# 配置二层交换机2960：

Switch>  
// 用户模式提示符，可执行基础查看命令


Switch>enable  
// 从用户模式进入特权模式（需要密码时需输入密码）


Switch#  
// 特权模式提示符，可执行更多管理和配置命令


Switch#configure terminal  
// 从特权模式进入全局配置模式

Enter configuration commands, one per line.  End with CNTL/Z.  
// 系统提示：每行输入一条配置命令，按Ctrl+Z结束


Switch(config)#vlan 2  
// 在全局配置模式下创建VLAN 2


Switch(config-vlan)#vlan 3  
// 在VLAN配置模式下继续创建VLAN 3（当前处于VLAN 2的配置模式，可直接创建新VLAN）


Switch(config-vlan)#exit  
// 从VLAN配置模式退出到全局配置模式


Switch(config)#interface fastEthernet 0/2  
// 进入快速以太网接口0/2的配置模式


Switch(config-if)#switchport access vlan 2  
// 将接口0/2配置为访问端口，并划分到VLAN 2


Switch(config-if)#exit  
// 从接口0/2的配置模式退出到全局配置模式


Switch(config)#interface fastEthernet 0/3  
// 进入快速以太网接口0/3的配置模式


Switch(config-if)#switchport access vlan 3  
// 将接口0/3配置为访问端口，并划分到VLAN 3


Switch(config-if)#exit  
// 从接口0/3的配置模式退出到全局配置模式


Switch(config)#interface fastEthernet 0/1  
// 进入快速以太网接口0/1的配置模式


Switch(config-if)#switchport mode trunk  
// 将接口0/1配置为中继端口（用于传递多个VLAN的流量）


Switch(config-if)#  
// 接口配置模式提示符（等待输入命令）
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to down  
// 系统日志：接口0/1的线路协议状态变为down
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to up  
// 系统日志：接口0/1的线路协议状态变为up


Switch(config-if)#end 
// 从接口配置模式直接返回特权模式（等同于按Ctrl+Z）


Switch#  
// 特权模式提示符
%SYS-5-CONFIG_I: Configured from console by console  
// 系统日志：配置通过控制台完成


Switch#show vlan
// 查看VLAN的配置信息（包括VLAN编号、名称、所属接口等）




# 配置三层交换机356060：

Switch>  
// 用户模式提示符，可执行基础查看命令


Switch>enable  
// 从用户模式进入特权模式（需密码时需输入密码）


Switch#  
// 特权模式提示符，可执行管理和配置命令


Switch#configure terminal  
// 从特权模式进入全局配置模式
Enter configuration commands, one per line.  End with CNTL/Z.  
// 系统提示：每行输入一条配置命令，按Ctrl+Z结束


Switch(config)#vlan 2  
// 创建VLAN 2


Switch(config-vlan)#vlan 3  
// 在VLAN配置模式下继续创建VLAN 3


Switch(config-vlan)#exit  
// 从VLAN配置模式退出到全局配置模式


Switch(config)#interface fastEthernet 0/1  
// 进入快速以太网接口0/1的配置模式


Switch(config-if)#switchport trunk encapsulation dot1q  
// 配置接口0/1的中继封装协议为802.1Q（VLAN标准封装协议）


Switch(config-if)#switchport mode trunk  
// 将接口0/1配置为中继端口（用于传输多个VLAN的流量）


Switch(config-if)#exit  
// 从接口0/1配置模式退出到全局配置模式


Switch(config)#interface fastEthernet 0/2  
// 进入快速以太网接口0/2的配置模式


Switch(config-if)#switchport access vlan 2  
// 将接口0/2配置为访问端口，并划分到VLAN 2


Switch(config-if)#exit  
// 从接口0/2配置模式退出到全局配置模式


Switch(config)#interface vlan 2  
// 进入VLAN 2的SVI（交换虚拟接口）配置模式（用于VLAN间路由）


Switch(config-if)#  
// 接口配置模式提示符（等待输入命令）
%LINK-5-CHANGED: Interface Vlan2, changed state to up  
// 系统日志：VLAN 2接口状态变为up
%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan2, changed state to up  
// 系统日志：VLAN 2接口的线路协议状态变为up


Switch(config-if)#ip address 192.168.1.1 255.255.255.0  
// 为VLAN 2的SVI配置IP地址和子网掩码


Switch(config-if)#no shutdown  
// 启用VLAN 2的SVI接口（默认可能关闭）


Switch(config-if)#exit  
// 从VLAN 2的SVI配置模式退出到全局配置模式


Switch(config)#interface fastEthernet 0/3  
// 进入快速以太网接口0/3的配置模式


Switch(config-if)#switchport access vlan 3  
// 将接口0/3配置为访问端口，并划分到VLAN 3


Switch(config)#interface vlan 3  
// 进入VLAN 3的SVI配置模式


Switch(config-if)#  
// 接口配置模式提示符
%LINK-5-CHANGED: Interface Vlan3, changed state to up  
// 系统日志：VLAN 3接口状态变为up
%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan3, changed state to up  
// 系统日志：VLAN 3接口的线路协议状态变为up


Switch(config-if)#ip address 192.168.2.1 255.255.255.0  
// 为VLAN 3的SVI配置IP地址和子网掩码


Switch(config-if)#no shutdown  
// 启用VLAN 3的SVI接口


Switch(config-if)#exit  
// 从VLAN 3的SVI配置模式退出到全局配置模式


Switch(config)#ip routing  
// 启用交换机的IP路由功能（实现VLAN间路由）


Switch(config)#end  
// 从全局配置模式直接返回特权模式（等同于Ctrl+Z）


Switch#  
// 特权模式提示符
%SYS-5-CONFIG_I: Configured from console by console  
// 系统日志：配置通过控制台完成


Switch#write  
// 保存当前配置到启动配置文件（NVRAM），避免重启后丢失


Switch#show ip route  
// 查看交换机的路由表（验证VLAN间路由是否生效）





