# 路由器Router0配置：

! 路由器初始用户模式（仅能执行基础查看命令，无配置权限）
Router>

! 从用户模式进入特权EXEC模式（enable命令，简称en），获取配置、管理权限
Router>enable 

! 特权模式提示符（#表示），可执行设备管理、配置保存、进入全局配置等操作
Router#

! 从特权模式进入全局配置模式（configure terminal，简称conf t），用于全局网络配置
Router#configure terminal 

Enter configuration commands, one per line.  End with CNTL/Z.  ! 系统提示：每条命令占一行，按Ctrl+Z可退出全局配置模式



! 进入FastEthernet 0/0接口（百兆以太网接口，编号0/0，通常用于连接内网网段）的配置模式
Router(config)#interface fastEthernet 0/0

! 为FastEthernet 0/0接口配置IP地址和子网掩码：IP=192.168.1.1，子网掩码=255.255.255.0（对应网段192.168.1.0/24）
! 该接口将作为192.168.1.0/24网段的网关
Router(config-if)#ip address 192.168.1.1 255.255.255.0

! 启用该接口（no shutdown，简称no shut），默认接口处于关闭（shutdown）状态，需手动启用
Router(config-if)#no shutdown 

%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up  
! 系统日志：FastEthernet0/0接口物理状态变为“up”（物理链路连通）
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up  
! 系统日志：FastEthernet0/0接口协议状态变为“up”（IP层协议正常，可通信）

! 退出当前接口配置模式，返回全局配置模式
Router(config-if)#exit



! 进入FastEthernet 1/0接口（百兆以太网接口，编号1/0，通常用于连接另一网段或外网）的配置模式
Router(config)#interface fastEthernet 1/0

! 为FastEthernet 1/0接口配置IP地址和子网掩码：IP=10.10.254.1，子网掩码=255.255.255.0（对应网段10.10.254.0/24）
! 该接口将作为10.10.254.0/24网段的网关
Router(config-if)#ip address 10.10.254.1 255.255.255.0

! 启用FastEthernet 1/0接口
Router(config-if)#no shutdown 
Router(config-if)#

%LINK-5-CHANGED: Interface FastEthernet1/0, changed state to up  
! 系统日志：FastEthernet1/0接口物理状态变为“up”
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/0, changed state to up  
! 系统日志：FastEthernet1/0接口协议状态变为“up”（IP层协议正常，可通信）

Router(config-if)#exit  ! 退出接口配置模式，返回全局配置模式



! 启用RIP路由协议（Routing Information Protocol，距离矢量路由协议，用于小型网络的路由自动学习）
Router(config)#router rip
Router(config-router)#  ! RIP路由协议配置模式提示符

! 指定RIP协议版本为版本2（RIPv2支持VLSM子网划分、认证，比RIPv1更常用）
Router(config-router)#version 2

! 宣告直连网络192.168.1.0：向RIP协议通告该网段，告知路由器需将该网段的路由信息发送给其他RIP邻居
Router(config-router)#network 192.168.1.0

! 宣告直连网络10.10.254.0：同理，向RIP协议通告该直连网段
Router(config-router)#network 10.10.254.0

! 退出RIP路由协议配置模式，返回全局配置模式
Router(config-router)#exit
Router(config)#



! 创建标准ACL（编号20，标准ACL编号范围1-99，仅基于源IP过滤）：拒绝单个主机192.168.1.2的流量
Router(config)#access-list 20 deny host 192.168.1.2

! 标准ACL 20的兜底允许规则：允许其他所有源IP的流量通过（ACL默认隐含“拒绝所有”，需显式配置允许规则避免全网断连）
Router(config)#access-list 20 permit any
Router(config)#



! 再次进入FastEthernet 1/0接口的配置模式（需将ACL应用到接口才能生效）
Router(config)#interface fastEthernet 1/0
Router(config-if)#

! 将标准ACL 20应用到FastEthernet 1/0接口的出方向（out）：
! 含义：从该接口“送出”的流量（即192.168.1.0/24网段→10.10.254.0/24网段的流量）将被ACL过滤
! 符合标准ACL“靠近源端出口部署”的原则，避免误过滤内部流量
Router(config-if)#ip access-group 20 out

! 退出所有配置模式，返回特权模式（end命令，等价于Ctrl+Z）
Router(config-if)#end
Router#



! 保存当前配置到路由器的NVRAM（非易失性内存）中（write命令，等价于copy running-config startup-config）
! 若不保存，重启路由器后配置会丢失
Router#write 



Building configuration...  ! 系统提示：正在构建配置（保存中）
[OK]  ! 系统提示：配置保存成功
Ro! 路由器初始用户模式（提示符“>”），仅支持基础查看命令，无配置权限



# 路由器Router1配置：

Router>

! 从用户模式进入特权EXEC模式（enable命令，简称en），获取设备管理和配置权限
Router>enable 

! 特权模式提示符（“#”表示），可执行配置保存、进入全局配置、设备重启等高级操作
Router#

! 从特权模式进入全局配置模式（configure terminal，简称conf t），用于全局网络参数配置
Router#configure terminal 
Enter configuration commands, one per line.  End with CNTL/Z.  ! 系统提示：每条命令单独一行，按Ctrl+Z可退出全局配置模式



! 进入FastEthernet 0/0接口（百兆以太网接口，编号0/0，通常用于连接内网192.168.2.0/24网段）的配置模式
Router(config)#interface fastEthernet 0/0

! 为FastEthernet 0/0接口配置IP地址和子网掩码：
! IP=192.168.2.1（作为192.168.2.0/24网段的网关），子网掩码=255.255.255.0（对应/24子网）
Router(config-if)#ip address 192.168.2.1 255.255.255.0

! 启用该接口（no shutdown，简称no shut）：路由器接口默认处于关闭（shutdown）状态，需手动启用才能通信
Router(config-if)#no shutdown 
Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up  ! 系统日志：FastEthernet0/0接口物理状态变为“up”（物理链路连通）
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up  ! 系统日志：接口协议状态变为“up”（IP层正常，可转发数据）

! 退出当前接口配置模式，返回全局配置模式
Router(config-if)#exit



! 进入FastEthernet 1/0接口（百兆以太网接口，编号1/0，通常用于连接10.10.254.0/24网段，与另一路由器互联）的配置模式
Router(config)#interface fastEthernet 1/0

! 为FastEthernet 1/0接口配置IP地址和子网掩码：
! IP=10.10.254.2（作为10.10.254.0/24网段的节点IP，用于路由器间互联），子网掩码=255.255.255.0
Router(config-if)#ip address 10.10.254.2 255.255.255.0
Router(config-if)#

! 启用FastEthernet 1/0接口
Router(config-if)#no shutdown 
Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet1/0, changed state to up  ! 系统日志：FastEthernet1/0接口物理状态“up”
Router(config-if)#exit  ! 退出接口配置模式，返回全局配置模式



! 启用RIP路由协议（Routing Information Protocol）：距离矢量路由协议，用于小型网络的路由自动学习与同步
Router(config)#router rip
Router(config-router)#  ! RIP路由协议配置模式提示符

! 指定RIP协议版本为版本2（RIPv2）：支持VLSM（可变长子网掩码）、路由认证，比RIPv1更适合现代网络
Router(config-router)#version 2
Router(config-router)#

! 向RIP协议宣告直连网络192.168.2.0：告知路由器将该网段的路由信息发送给其他RIP邻居，实现跨网段通信
Router(config-router)#network 192.168.2.0

! 向RIP协议宣告直连网络10.10.254.0：同理，通告该互联网段的路由信息
Router(config-router)#network 10.10.254.0

! 退出RIP路由协议配置模式，返回全局配置模式
Router(config-router)#exit



! 创建名为“deny01”的扩展ACL（extended ACL）：扩展ACL支持基于源IP、目的IP、协议、端口的精细过滤
Router(config)#ip access-list extended deny01
Router(config-ext-nacl)#  ! 扩展ACL配置模式提示符

! 扩展ACL规则1：拒绝任意源地址（any）向内网192.168.2.0/24网段（反码0.0.0.255）发送ICMP Echo请求（echo=ping请求，ICMP类型8）
! 作用：外部设备（如其他网段、外网）无法ping通192.168.2.0/24网段的所有主机
Router(config-ext-nacl)#deny icmp any 192.168.2.0 0.0.0.255 echo 

! 扩展ACL规则2：拒绝192.168.2.0/24网段向内网任意地址发送ICMP Echo应答（echo-reply=ping回复，ICMP类型0）
! 作用：即使192.168.2.0/24主机主动ping外部，也无法发送回复包（补充阻断ping双向通信）
Router(config-ext-nacl)#deny icmp 192.168.2.0 0.0.0.255 any echo-reply 

! 扩展ACL规则3：拒绝任意源地址向192.168.2.0/24网段发起TCP协议的HTTP连接（eq www=端口80，www是HTTP的关键字）
! 作用：外部设备无法通过浏览器访问192.168.2.0/24网段内的Web服务器
Router(config-ext-nacl)#deny tcp any 192.168.2.0 0.0.0.255 eq www

! 扩展ACL规则4：拒绝任意源地址向192.168.2.0/24网段发起TCP协议的FTP连接（eq ftp=端口21，FTP控制连接端口）
! 作用：外部设备无法通过FTP协议访问192.168.2.0/24网段内的FTP服务器
Router(config-ext-nacl)#deny tcp any 192.168.2.0 0.0.0.255 eq ftp

! 扩展ACL兜底允许规则：允许所有IP协议（TCP、UDP、ICMP等）的任意源地址到任意目的地址的流量通过
! 关键：ACL默认隐含“拒绝所有”（implicit deny any any），必须显式配置该规则，否则除被拒绝的流量外，其他合法流量也会被阻断
Router(config-ext-nacl)#permit ip any any

! 退出扩展ACL配置模式，返回全局配置模式
Router(config-ext-nacl)#exit
Router(config)#



! 再次进入FastEthernet 1/0接口的配置模式（该接口是路由器互联接口，外部流量需通过此接口进入内网）
Router(config)#interface fastEthernet 1/0
Router(config-if)#

! 将扩展ACL“deny01”应用到FastEthernet 1/0接口的入方向（in）：
! 含义：所有从外部通过该接口进入路由器（最终去往192.168.2.0/24网段）的流量，都会被ACL“deny01”过滤
! 符合扩展ACL“靠近目的端部署”的原则：在外部流量进入内网前直接拦截，节省内部网络带宽
Router(config-if)#ip access-group deny01 in

! 退出所有配置模式，返回特权模式（end命令，等价于Ctrl+Z）
Router(config-if)#end
Router#
%SYS-5-CONFIG_I: Configured from console by console  ! 系统日志：配置来自控制台（本地操作）



! 保存当前运行配置（running-config）到NVRAM（非易失性内存）中的启动配置（startup-config）
! 若不执行此命令，路由器重启后所有配置会丢失（write命令等价于copy running-config startup-config）
Router#write 
Building configuration...  ! 系统提示：正在构建并保存配置
[OK]  ! 系统提示：配置保存成功
Router#uter#


